{
  "backend/main.mo": "Empty Motoko actor serving as the ICP backend placeholder with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the asymmetric exponential smoothing change in movementDetection.ts, where the smoothed score resets to zero immediately when no movement is detected instead of decaying gradually.",
  "frontend-file-summaries.txt": "JSON-formatted catalog of short summaries for all frontend source files, describing each module's purpose and notable implementation details.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Squid Game app, mounting the React root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React component that composes the 3D scene, webcam overlay, HUD elements, and full-screen modal screens based on the current game phase managed by useGameState.",
  "frontend/src/components/CountdownDisplay.tsx": "Displays an animated 3-2-1 countdown with a pop-in keyframe animation and instructional text before the game starts.",
  "frontend/src/components/EliminatedScreen.tsx": "Full-screen elimination result overlay showing the player's final progress percentage, survival time, and a Try Again button.",
  "frontend/src/components/FollowCamera.tsx": "React Three Fiber component that smoothly lerps the camera position and look-at target to follow the player's Z position each frame.",
  "frontend/src/components/GameCanvas.tsx": "Empty file with no content or exports.",
  "frontend/src/components/IdleScreen.tsx": "Welcome screen displaying the game title, how-to-play instructions, and a Start Game button to begin the countdown.",
  "frontend/src/components/Player.tsx": "3D player character built from Three.js primitives (cylinder, spheres, legs) that smoothly interpolates toward the target Z position and changes color based on game phase.",
  "frontend/src/components/ProgressBar.tsx": "Horizontal progress bar with phase-aware fill color, glow shadow, a shine overlay, and milestone tick marks at 25%, 50%, and 75%.",
  "frontend/src/components/SensitivitySlider.tsx": "Range input slider for movement detection sensitivity (1–100) with dynamic color and label (Forgiving/Normal/Strict/Brutal) based on the current value.",
  "frontend/src/components/StatusText.tsx": "Renders a pulsing GREEN LIGHT or RED LIGHT status label with phase-appropriate glow colors, returning null for non-active phases.",
  "frontend/src/components/ThreeScene.tsx": "Renders the 3D game scene using React Three Fiber, including ground, finish line, doll, lighting, player, and follow camera components based on game progress and phase.",
  "frontend/src/components/Timer.tsx": "Displays a formatted elapsed time (minutes, seconds, tenths) from a millisecond value as a styled UI component.",
  "frontend/src/components/WebcamOverlay.tsx": "Renders a webcam feed with pose-tracking skeleton overlay in a fixed corner UI, reporting movement scores to the parent and showing camera/tracking status indicators.",
  "frontend/src/components/WonScreen.tsx": "Displays the win screen with final progress, elapsed time, and a 'Play Again' button after the player successfully completes the game.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and returns an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useGameState.ts": "Custom hook managing the full Red Light/Green Light game state machine, including phase transitions, progress updates, countdown, elimination logic, and audio effects.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence with status tracking.",
  "frontend/src/hooks/useMovementDetection.ts": "File appears to be empty or truncated with no content provided.",
  "frontend/src/hooks/usePoseTracking.ts": "React hook that initializes MediaPipe Pose, runs a requestAnimationFrame loop to process webcam frames, draws a mirrored skeleton overlay on a canvas, and returns movement score, landmarks, readiness state, and errors.",
  "frontend/src/hooks/useWebcam.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global CSS file that imports Bebas Neue and Share Tech Mono fonts, sets up Tailwind layers, defines dark-themed CSS custom properties for game UI tokens, and adds utility classes and keyframe animations.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/modules/gameState.ts": "Defines the game state machine types, initial state, and pure functions for determining progress advancement, elimination, phase transitions, and random light durations based on movement score and sensitivity.",
  "frontend/src/modules/movementDetection.ts": "Computes an exponentially-smoothed movement score from MediaPipe landmark buffers using only stable core landmarks, with a pre-filter threshold and asymmetric smoothing that resets immediately when movement stops.",
  "frontend/src/modules/poseTracking.ts": "Loads MediaPipe Pose via CDN script injection, initializes a Pose instance with configurable options, and provides a drawPoseSkeleton utility to render the skeleton on a canvas.",
  "frontend/src/modules/scene.ts": "Defines 3D scene layout constants (track length, camera offsets, colors, positions) and a helper to convert game progress (0–100) to a Z-axis world position.",
  "frontend/src/utils/audioEffects.ts": "Provides procedural Web Audio API sound effects for game events: green light, red light, elimination, victory, and countdown beep.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom game colors (pink, red, green, gold), display/mono fonts, glow box shadows, and countdown/fade-in animations. Includes the tailwindcss-animate and @tailwindcss/typography plugins.",
  "project_state.json": "Project state tracking file describing the current architecture of a Squid Game-themed browser game using React Three Fiber for 3D rendering and MediaPipe Pose for webcam-based movement detection, along with known issues, existing features, and architectural decisions."
}