{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report describing three high-confidence features related to dead-zone clamping in movementDetection.ts, elimination guard in gameState.ts, and score consumption in useGameState.ts, each mapped to test IDs and component dependencies.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's frontend modules, hooks, components, and utilities.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, including color tokens for backgrounds, borders, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Squid Game app, mounting the React root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that composes the 3D scene, webcam overlay, HUD elements, and full-screen modal screens (idle, eliminated, won) based on the current game phase from useGameState.",
  "frontend/src/components/CountdownDisplay.tsx": "Displays an animated 3-2-1 countdown with a pop-in keyframe animation and instructional text before the game starts.",
  "frontend/src/components/EliminatedScreen.tsx": "Full-screen elimination result overlay showing final progress percentage, a progress bar, survival time, and a Try Again button.",
  "frontend/src/components/FollowCamera.tsx": "React Three Fiber component that smoothly lerps the camera position and look-at target to follow the player's Z position each frame.",
  "frontend/src/components/GameCanvas.tsx": "Empty file with no implemented content.",
  "frontend/src/components/IdleScreen.tsx": "Welcome screen displaying the game title, how-to-play instructions, and a Start Game button to initiate gameplay.",
  "frontend/src/components/Player.tsx": "3D player character built from Three.js primitives (cylinder, spheres, legs) that smoothly interpolates toward a Z position derived from progress, with phase-based color changes for normal, eliminated, and won states.",
  "frontend/src/components/ProgressBar.tsx": "Horizontal progress bar component with phase-aware fill color and glow, a shine overlay, and milestone markers at 25%, 50%, and 75%.",
  "frontend/src/components/SensitivitySlider.tsx": "A range slider component for adjusting game sensitivity, displaying labeled levels (FORGIVING/NORMAL/STRICT/BRUTAL) with corresponding colors based on the current value.",
  "frontend/src/components/StatusText.tsx": "Displays an animated 'GREEN LIGHT' or 'RED LIGHT' text with matching neon colors during those game phases, rendering nothing otherwise.",
  "frontend/src/components/ThreeScene.tsx": "A React Three Fiber 3D scene component rendering a ground plane, finish line, doll figure, stars, and dynamic lighting that changes color based on the current game phase.",
  "frontend/src/components/Timer.tsx": "Formats and displays an elapsed time in milliseconds as a MM:SS.t or SS.ts string using a monospace display font.",
  "frontend/src/components/WebcamOverlay.tsx": "A fixed-position overlay that activates the webcam, runs pose tracking, renders a mirrored video feed with skeleton overlay on a canvas, and reports movement scores to the parent component.",
  "frontend/src/components/WonScreen.tsx": "Displays a win screen with the final time, a full progress bar, and a 'PLAY AGAIN' button when the player completes the game.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using React Query, supporting both authenticated (Internet Identity) and anonymous actors, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGameState.ts": "A React hook managing the full game state machine (idle, countdown, green-light, red-light, eliminated, won), handling phase transitions, progress updates, timers, and audio effects based on movement score and sensitivity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components via a React context provider.",
  "frontend/src/hooks/useMovementDetection.ts": "File is empty with no content.",
  "frontend/src/hooks/usePoseTracking.ts": "React hook that initializes MediaPipe Pose, runs a requestAnimationFrame loop to process webcam frames, buffers landmarks, and returns a movement score, current landmarks, readiness state, and any error.",
  "frontend/src/hooks/useWebcam.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global stylesheet that imports Bebas Neue and Share Tech Mono fonts, defines Tailwind base/components/utilities, sets dark game-themed CSS custom properties, and adds utility classes for glow effects and animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/modules/gameState.ts": "Defines the game state machine types and pure functions for determining phase transitions, progress advancement, and elimination based on movement score and sensitivity, including a dead-zone guard.",
  "frontend/src/modules/movementDetection.ts": "Provides functions to compute a smoothed movement score from a buffer of MediaPipe landmark frames using core body points, and utilities to map sensitivity to thresholds, apply a dead zone clamp, and check if movement exceeds a threshold.",
  "frontend/src/modules/poseTracking.ts": "Loads MediaPipe Pose via CDN script injection, initializes a Pose instance with configurable options, and exposes helpers to send video frames for processing and draw the skeleton on a canvas.",
  "frontend/src/modules/scene.ts": "Exports 3D scene layout constants (track length, camera offsets, colors, etc.) and a helper to convert game progress (0–100) to a Z-axis position.",
  "frontend/src/utils/audioEffects.ts": "Provides procedural Web Audio API sound effects for game events: green light, red light, elimination, victory, and countdown beep.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom game colors (pink, red, green, gold), display/mono fonts, glow box shadows, and countdown/fade-in animations. Enables dark mode via class and includes the tailwindcss-animate and @tailwindcss/typography plugins.",
  "project_state.json": "Project state document (version 11) describing a Squid Game Red Light/Green Light browser game built with React Three Fiber for 3D rendering and MediaPipe Pose for webcam-based movement detection, including known issues around webcam overlay rendering and dead-zone reliability."
}