{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented game features (UI layout, state machine, movement detection, progress bar, elimination) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to one-sentence descriptions summarizing each file's purpose and notable implementation details.",
  "frontend/index.css": "Tailwind base import with CSS custom property tokens for light and dark shadcn UI themes covering background, foreground, card, border, chart, and sidebar colors.",
  "frontend/index.html": "Minimal HTML shell titled 'Squid Game: Red Light, Green Light' that mounts the React app at the #root div via main.tsx.",
  "frontend/src/App.tsx": "Root React component that wires together all game hooks and UI components, managing sensitivity state, movement score, phase-based background glow/border styling, and conditional rendering of idle/active/eliminated/won screens.",
  "frontend/src/components/CountdownDisplay.tsx": "Displays an animated 3-2-1 countdown with a key-triggered pop-in animation and Bebas Neue cinematic typography.",
  "frontend/src/components/EliminatedScreen.tsx": "Elimination result screen showing final progress percentage, survival time, a red progress bar, and a styled 'Try Again' button.",
  "frontend/src/components/GameCanvas.tsx": "Renders the webcam feed onto a canvas via useWebcam and useMovementDetection hooks, with overlays for camera requesting, error, and standby states.",
  "frontend/src/components/IdleScreen.tsx": "Welcome screen displaying the game title, color-coded instructions for green/red light rules, and a styled 'Start Game' button with camera access notice.",
  "frontend/src/components/ProgressBar.tsx": "Renders a styled progress bar with color changes based on game phase (green/red/pink), milestone markers, and a shine effect.",
  "frontend/src/components/SensitivitySlider.tsx": "A range input slider for adjusting movement detection sensitivity, displaying a labeled difficulty level (FORGIVING to BRUTAL) based on the current value.",
  "frontend/src/components/StatusText.tsx": "Displays animated 'GREEN LIGHT' or 'RED LIGHT' status text with appropriate colors and sub-labels based on the current game phase.",
  "frontend/src/components/Timer.tsx": "Formats and displays a time value (in seconds) as a styled countdown/elapsed timer with minutes, seconds, and tenths.",
  "frontend/src/components/WonScreen.tsx": "Victory screen shown when the player reaches 100% progress, displaying final time, a full progress bar, and a 'Play Again' button.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage.",
  "frontend/src/hooks/useGameState.ts": "Core game logic hook managing phase transitions (idle, countdown, green-light, red-light, eliminated, won), progress tracking, survival timer, and audio cues.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, handling login, logout, and identity persistence via DFINITY's AuthClient.",
  "frontend/src/hooks/useMovementDetection.ts": "Uses requestAnimationFrame to compare consecutive webcam frames pixel-by-pixel, computing a smoothed movement score for motion detection.",
  "frontend/src/hooks/useWebcam.ts": "Manages webcam stream lifecycle—requesting access, attaching the stream to a video element, and cleaning up tracks on unmount.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind directives, imports Google Fonts, defines CSS custom properties for the dark Squid Game aesthetic (pink/red/green accents), and declares utility classes and keyframe animations used throughout the game UI.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/audioEffects.ts": "Procedurally generates all game sound effects (green light chime, red light alarm, elimination screech) using the Web Audio API with no external audio files.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with game-specific colors, fonts (Bebas Neue, Inter), glow box-shadows, and OKLCH-based design tokens; includes typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project's current build state, architectural decisions, implemented features, and known issues for a Squid Game-themed Red Light/Green Light browser game built with React, MediaPipe, and Web Audio API."
}