{
  "kind": "build_request",
  "title": "Reduce movement score decay delay when player stops moving",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "In movementDetection.ts, make the exponential smoothing asymmetric: when the current per-landmark delta (after base-threshold pre-filter) is zero or below the base threshold — meaning the player has stopped moving — reset the smoothed score to zero immediately rather than decaying it gradually. Only apply the slow decay formula (smoothedDelta = prevDelta × 0.8 + currentDelta × 0.2) when active movement is detected. This ensures the exported movement score drops to zero the moment no movement is registered, eliminating the perceived lag when the player freezes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "i want the movement to immediately update when the player stops moving. I dont like the delay"
        ]
      },
      "acceptanceCriteria": [
        "When all tracked landmarks (shoulders, hips, nose) produce per-landmark deltas below the base movement threshold in the current frame, the smoothed score is set to 0 immediately — not decayed from its previous value.",
        "When active movement is detected (at least one landmark delta exceeds the base threshold), the existing exponential smoothing formula (prevDelta × 0.8 + currentDelta × 0.2) continues to apply.",
        "The dead-zone clamp and downstream game logic in useGameState.ts and gameState.ts are unaffected — they still consume the clamped score from movementDetection.ts.",
        "During Red Light, stopping movement immediately causes the exported score to read 0, preventing any false eliminations due to smoothing tail-off.",
        "During Green Light, stopping movement immediately halts progress advancement with no visible delay."
      ]
    }
  ],
  "constraints": [
    "Do not change the exponential smoothing behaviour when movement IS actively occurring — only the stop/reset path changes.",
    "Do not modify any immutable frontend paths: useInternetIdentity.ts, useActor.ts, main.tsx, or components/ui.",
    "The dead zone guard in gameState.ts and the clamping in movementDetection.ts must remain intact."
  ],
  "nonGoals": [
    "Changing the smoothing alpha values used during active movement.",
    "Modifying the 200ms elimination confirmation window in gameState.ts or useGameState.ts.",
    "Altering the base movement threshold default value.",
    "Any backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}