{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reduce movement score decay delay when player stops moving",
  "requirements": [
    {
      "id": "REQ-26",
      "summary": "Implement asymmetric exponential smoothing in movementDetection.ts to reset the smoothed movement score to zero immediately when the player stops moving, while maintaining the existing slow decay formula during active movement",
      "acceptanceCriteria": [
        "When all tracked landmarks (shoulders, hips, nose) produce per-landmark deltas below the base movement threshold in the current frame, the smoothed score is set to 0 immediately — not decayed from its previous value.",
        "When active movement is detected (at least one landmark delta exceeds the base threshold), the existing exponential smoothing formula (prevDelta × 0.8 + currentDelta × 0.2) continues to apply.",
        "The dead-zone clamp and downstream game logic in useGameState.ts and gameState.ts are unaffected — they still consume the clamped score from movementDetection.ts.",
        "During Red Light, stopping movement immediately causes the exported score to read 0, preventing any false eliminations due to smoothing tail-off.",
        "During Green Light, stopping movement immediately halts progress advancement with no visible delay."
      ],
      "file_operations": [
        {
          "path": "frontend/src/modules/movementDetection.ts",
          "operation": "modify",
          "description": "Modify the exponential smoothing logic to detect when the current per-landmark delta (after base-threshold pre-filter) indicates no active movement. When all landmarks produce deltas at or below the base threshold, immediately reset the smoothed score to 0 instead of applying the decay formula. When active movement is detected (at least one landmark delta exceeds the base threshold), continue using the existing exponential smoothing formula (prevDelta × 0.8 + currentDelta × 0.2). Ensure the dead-zone clamp and sensitivity-to-threshold mapping remain intact and unchanged."
        }
      ]
    }
  ]
}